task: detect

nc: 4  # number of classes

backbone:
  # [from, repeats, module, args]
  - [-1, 1, SwinTransformer, {
        patch_size: 4,
        in_chans: 3,
        embed_dim: 96,
        depths: [2, 2, 6, 2],
        num_heads: [3, 6, 12, 24],
        window_size: 7,
        mlp_ratio: 4.0,
        qkv_bias: true,
        qk_scale: null,
        drop_rate: 0.0,
        attn_drop_rate: 0.0,
        drop_path_rate: 0.1,
        ape: false,
        patch_norm: true,
        out_indices: [1, 2, 3],
        frozen_stages: -1,
        use_checkpoint: false
      }]

head:
  # [from, repeats, module, args]
  - [-1, 1, Detect, [nc]]
